{
        "firstname" : "Christopher",
        "lastname" : "Fudge",
        "handle" : "",
        "birth" : "July 8, 1957",
        "death" : "November 19, 2019",
        "obituary" : "https://everdays.com/funeral-homes/usa/co/centennial/horan--mcconaty---south-metrocentennial/christopher-reid-fudge",
        "issue" : "127",
        "affiliations" : "ISSA",
        "mainimage" : "/images/christopherfudge.jpg",
        "maintext" : "<p>Reid, Fudge passed away peacefully at age 62 on November 19th, 2019 in Highlands Ranch Colorado. He will forever be remembered by all those who met him as a kind-hearted soul that warmed any room he walked into. His journey in this life began in Jacksonville, Florida on July 8th, 1957. Born to two loving parents Linda and Donald Fudge.\n Reid is survived by his loving wife and life-long partner of 44 years, Linda Fudge; his brother John Fudge; sister Lucia Hazen; mother Linda Smith; daughter Jade Hirvela; son Dylan Fudge; daughter-in-law Vianey Fudge; son-in-law Bo Hirvela; grand-son Tychus Fudge; grand-daughter Kaylee Cortez; niece Savannah Hazen; and nephew Hunter Hazen.</p><p> It was while attending college at the University of Florida he met the woman that changed his life forever, Linda Swanson soon to be Fudge. Their relationship quickly blossomed into a beautiful marriage. Following graduation, they both moved to Colorado where Reid’s career fell into the world of information technology. He quickly advanced within the IT field pioneering many novel methods. Reid’s fast career progress can partly be attributed to his hard work ethic and keen intellect although these traits applied to anything Reid put his mind to which expanded far beyond his career.</p><p> Reid was a person of faith. He had a passion for politics, horticulture, guitars, guns, golfing, culinary delights, and travel. One passion he held high above the rest was the love for his family. His love for his family and friends was unconditional and obvious in the time he dedicated to them. His wisdom, kindness, patience, and love will always be admired and sorely missed.</p><p> Reid Fudge was dearly loved by so many and will be missed beyond measure.A ceremony will be held Saturday, 11.23.2019 at 3 PM at St. Timothy’s Episcopal Church; 1401 East Dry Creek Rd., Littleton, CO, 80122. Donations may be sent to the St. Jude Children’s Hospital in Reid’s honor.</p>",
        "socialmedialinks" : [
                {
                        "sitename" : "LinkedIn",
                        "siteurl" : "https://www.linkedin.com/in/reid-fudge-3bb9151/"
                }
        ],
        "contributions" : [
                {
                        "title" : "CISO at Tri-State Generation"
                }
        ]
}
