{
  "firstname": "Geoffrey",
  "lastname": "Bennett",
  "handle": "",
  "birth": "1966",
  "death": "2008",
  "affiliations": "AHA!",
  "issue": "33",
  "obituary": "https://www.dignitymemorial.com/obituaries/austin-tx/geoffrey-bennett-8211772",
  "mainimage": "/images/Geoffrey_Bennett.jpg",
  "maintext": "<p>From Obituary: Geoffrey Southerland Bennett On April 6, 2008, Geoffrey Southerland Bennett, passed away while jogging at the Dell Jewish Community Center of Austin. Born in Washington, D.C. on August 22, 1966, Geoff was 41 years old. Geoffrey was a very loving and nurturing father to his daughter, Ruthie. He produced 'Ruthie's Daily Grind', an internet blog on Ruthie's development from infancy through preschool.</p><p>Geoffrey graduated from Austin High School and was an outstanding gymnast in high school and college. While attending Austin High, he held all but one of the men's gymnastic records. Geoffrey earned a BFA degree at the University of Oklahoma and was an accomplished artist. Geoff was an avid reader with a passion for satire. He was employed by TICOM, Inc., and was a highly regarded Information Systems Security Analyst and Network Administrator.</p><p>Survivors include his daughter, Ruth Lynelle Bennett; wife, Jennifer Godfrey Bennett; mother, Mary Beth Bennett; father, Baylus Bennett; brother, Chad Bennett and his wife Catherine and their children Cadyn and Chase Bennett. Visitation will be held Wednesday April 9, from 6:00 – 8:00 p.m. at Weed-Corley-Fish Funeral Home, 3125 N. Lamar. Services will be held at 1 pm on Thursday, April 10, at Weed-Corley-Fish Funeral Home. Interment will follow at Austin Memorial Park. Pallbearers are: Chad Bennett, Raymond Bennett, Willie Bennett, Bruce Tabor, Kevin Godfrey, Ian Robertson, Jason Johnston, and Aqueel Darbar. In lieu of flowers contributions to the following organizations are welcome, Dell Children's Hospital, Town Lake Animal Center, and Capitol School of Austin</p>",
  "socialmedialinks": [],
  "contributions": [],
  "gallery": []
}
